/*
 *   변수 ===> 알파벳
 *   연산자 ==> 단어
 *   제어문 ==> 단어 => 문장
 *   메소드 ==> 독해 
 *   클래스 ==> 회화
 *   데이터 처리
 *     연산자
 *     ====
 *       단항 연산자
 *        = 증감연산자 (++,--) :  1증가, 1감소
 *          int a=10;
 *          int b=a++;
 *              ===
 *               1 ==
 *                  2
 *        
 *         int a=10;
 *         int b=++a
 *               == 1
 *             ======2
 *        = 부정연산자 (!) ===> 조건문 (if,while,for) => true/false
 *        = 타입연산자 (데이터형) ==> 형변환
 *          int ==> (int)10.5 ==> 10
 *          char ==> (char)65 ==> 'A'
 *          ==> int이하는 연산처리하면 => int
 *        
 *        이항연산자
 *          = 산술연산자 (+,-,*,/,%)
 *             / (0으로 나눌 수 없다, 정수/정수=정수)
 *             % (나머지 => 왼쪽의 부호를 따라 간다)
 *          = 비교연산자 ( == , != , < , > , <= , >= ) => true/false
 *          = 논리연산자 ( && , || ) => 두개의 조건을 가지고 연산처리 => true/false
 *            효율적인 연산 
 *              && ==> (false)&&() ==> false
 *              || ==>  (true)||() ==> true
 *          = 대입연산자
 *            =
 *            (복합대입연산자)  ==> for , 값을 누적
 *            +=
 *              int a=10;
 *              a+=10  ==============> a=a+10
 *            -= 
 *              int a=10;
 *              a-=5   ==============> a=a-5
 *              
 *           삼항연산자 (? :)
 *            (조건)?값1:값2
 *            ====
 *            true  ==> 값1
 *            false ==> 값2  ====> if~else
 */
public class 일주차정리3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
